app/controllers/descontos_controller.rb

SELECT "descontos".* FROM "descontos"
---
  def index
    @descontos = Desconto.all

INSERT INTO "descontos" ("users_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["users_id", 0], ["created_at", "2015-12-10 18:32:10.584802"], ["updated_at", "2015-12-10 18:32:10.584802"]]
---
  def create
    @desconto = Desconto.new(desconto_params)

    respond_to do |format|
      if @desconto.save

DELETE FROM "descontos" WHERE "descontos"."id" = ?  [["id", 1]]
---
  def destroy
    @desconto.destroy

SELECT  "descontos".* FROM "descontos" WHERE "descontos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_desconto
      @desconto = Desconto.find(params[:id])