app/controllers/estabelecimentos_controller.rb

  def index
    @estabelecimentos = Estabelecimento.all
---
SELECT "estabelecimentos".* FROM "estabelecimentos"

  def create
    @estabelecimento = Estabelecimento.new(estabelecimento_params)

    respond_to do |format|
      if @estabelecimento.save
---
INSERT INTO "estabelecimentos" ("nome", "cnpj", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "xxx"], ["cnpj", ""], ["created_at", "2015-12-10 18:17:05.740530"], ["updated_at", "2015-12-10 18:17:05.740530"]]

  def destroy
    @estabelecimento.destroy
---
DELETE FROM "estabelecimentos" WHERE "estabelecimentos"."id" = ?  [["id", 1]]

    def set_estabelecimento
      @estabelecimento = Estabelecimento.find(params[:id])
---
SELECT  "estabelecimentos".* FROM "estabelecimentos" WHERE "estabelecimentos"."id" = ? LIMIT 1  [["id", 1]]