app/controllers/geolocalizacaos_controller.rb

  def index
    @geolocalizacaos = Geolocalizacao.all
---
SELECT "geolocalizacaos".* FROM "geolocalizacaos"