app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "senha", "datanasc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Paulo"], ["email", "donfofn"], ["senha", -12], ["datanasc", "2015-12-07"], ["created_at", "2015-12-07 22:17:46.181987"], ["updated_at", "2015-12-07 22:17:46.181987"]]